---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUnique
source: html/8b31815c-30d7-9aec-d618-35c50e9819e3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUnique Property

Sheet views cannot contain more than one instance of "%1!s!."

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewOnASheetMustBeUnique { get; }
```